{
  "main": {
    "name": "Itaru Kishikawa",
    "occupation": "Full-Stack Software Engineer",
    "description": "I'm packed with everything need to go. And looking for the next trip :)",
    "position": "Site",
    "image": "profilepic.jpg",
    "bio": "Know where to go.",
    "contactmessage": "I would like to discuss new opportunities. Let's talk and find it. Always welcome and look forward to hearing from you. See you in the near future.",
    "email": "itaru.kishikawa@gmail.com",
    "phone": "+81 (070)-8978-3950",
    "address": {
      "city": "San Jose",
      "state": "CA"
    },
    "website": "https://itaru.space",
    "resumedownload": "https://drive.google.com/file/d/1IPiMOWSL0C5Xy7QuUuqVZgMLiKRbqNQt/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/itaru.kishikawa.1/",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/itaru-kishikawa/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Itaru7",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "San Jose State University",
        "degree": "Bachelor of Science, Computer Science",
        "graduated": "09/2016 - 05/2019",
        "description": ""
      },
      {
        "school": "Orange Coast College",
        "degree": "Associate of Science, Mathematics",
        "graduated": "09/2013 - 05/2016",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "NANDORA, Co.",
        "positions":[
          {
            "title": "Software Engineer / Project Manager",
            "years": "01/2022 - Ongoing",
            "description": [
              "• Worked with C-level suite to create vision and goals for the projects, and represented customers to ensure quick product adoption",
              "• Collaborated with a team of 5 software engineers to work cross-functionally with software, marketing, and UI design teams to align marketing messaging with the project scopeCollaborated with a team of 5 software engineers to work cross-functionally with software, marketing, and UI design teams to align marketing messaging with the project scope",
              "• Managed communication across Engineering, Designing, and Business departments to schedule and plan the solutions to solve the problems eﬃciently in terms of time, resource, and cost",
              "• Assisted in the development and implementation of changes to the software by providing feedback from customers and analyzing user engagement using a service monitoring tool",
              "• Proposed, listed, planned, assigned, tested, and delivered a new feature to the application and increased user engagement by about 48%"
            ]
          }
        ]
      },
      {
        "company": "Fujisoft America, Inc.",
        "positions":[
          {
            "title": "Software Engineer / Technical Support",
            "years": "01/2019 - 09/2021",
            "description": []
          },
          {
            "title": "Technical Support",
            "description": [
              "• Performed a variety of Technical and supportive tasks over the phone or via web messenger related to networks, servers, workstations, and peripherals including but not limited to the assembly, installation, maintenance, and troubleshooting of hardware equipment and software",
              "• Communicated with customers to identify issues, walk through solutions, and initiate corrective actions to restore service and functionality",
              "• Gathered customer and technology information to determine technical support level; elevate calls to appropriate support level as necessary",
              "• Assisted and worked closely with network support staﬀ and administrator in conﬁguring, implementing, and maintaining network connectivity",
              "• Worked with the software development team on reported errors and bugs on newly released software and assisted in the deployment of release ﬁxes",
              "• Keep customers informed of progress during the issue lifecycle and make follow-up calls or communications in a timely manner",
              "• Established patterns for reoccurring issues and provided input to development teams",
              "• Accessed and documented procedures, tools, and manuals to provide support on company-supplied hardware, equipment, and software"
            ]
          },
          {
            "title": "Full Stack Software Engineer",
            "description": [
              "• Built a web-based Daily Sales Summary Dashboard Full-Stack",
              "• Designed and implemented with Python, Ubuntu, Nginx, Kintone(partnership DB), React, JavaScript, HTML and CSS",
              "• Published and hosted in a private URL on AWS EC2"
            ]
          },
          {
            "title": "Deep Learning, Image Recognition Work",
            "description": [
              "• Completed word extraction tool using image recognition to the production level with Python",
              "• Modify and implemented the shape detection algorithms and extracted characters inside the box on the PDF",
              "• Trained OCR (Optical Character Recognition is the use of technology to distinguish printed or handwritten text characters inside digital images of physical documents) engine to increase the accuracy from around 76% to 99%"
            ]
          }
        ]
      },
      {
        "company": "Genial Technology, Inc.",
        "positions":[
          {
            "title": "Software Engineer",
            "years": "July 2019 – January 2020",
            "description": [
              "• Developed a user registration page with a subscription payment system with Strip, JavaScript, HTML and CSS",
              "• Experimented and researched about OCR to improve accuracy for Chinese characters by applying formulas or algorithms from research papers on Python backend",
              "• Contributed a research paper for the annual convention of The Association for Natural Language Processing about OCR in 2020"
            ]
          },
          {
            "title": "Software Engineer Intern Lead",
            "years": "June 2018 – August 2018",
            "description": [
              "• Enhanced accuracy of OCR from 30% to 95% by introducing LSTM using Python",
              "• Spearheaded design and implementation using Google Tesseract to customize product prototypes of a web application with OCR engine applying image-to-text recognition of audit materials",
              "• Migrated API modules from On-Premise to Cloud (AWS EC2 and API Gateway)",
              "• Researched, developed, and customized web applications and open-source python libraries to make them work with ImageMagick, yml ﬁles, ocrmypdf, and leptonica to improve the accuracy of the OCR system"
            ]
          }
        ]
      }
    ],
    "certificates": [
      {
        "title": "Databases and SQL for Data Science by IBM",
        "image": "databases_and_sql_for_data_science.png",
        "url": "https://www.credly.com/badges/b7fa929f-9e36-4dfc-ab7c-6b27db30f5ef/linked_in_profile"
      },
      {
        "title": "AWS Cloud Practitioner",
        "image": "aws_cloud_practitioner.png",
        "url": "https://www.credly.com/badges/8d77dcfd-1ffb-4a5a-a259-e1abe4893623?source=linked_in_profile"
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "90%"
      },
      {
        "name": "Nginx",
        "level": "80%"
      },
      {
        "name": "React",
        "level": "80%"
      },
      {
        "name": "CSS",
        "level": "75%"
      },
      {
        "name": "Ruby",
        "level": "75%"
      },
      {
        "name": "AWS",
        "level": "70%"
      },
      {
        "name": "HTML5",
        "level": "70%"
      },
      {
        "name": "SQL",
        "level": "70%"
      },
      {
        "name": "Ubuntu",
        "level": "70%"
      },
      {
        "name": "C++",
        "level": "65%"
      },
      {
        "name": "Java",
        "level": "60%"
      },
      {
        "name": "JavaScript",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "AWS Project",
        "category": "S3, Lambda, SNS",
        "image": "aws_project.png",
        "url": "https://github.com/Itaru7/AWS-Project"
      },
      {
        "title": "Weather Forecast Web App",
        "category": "Python - Flask, JavaScript",
        "image": "weather_forecast.png",
        "url": "https://itaru-weather.herokuapp.com/index"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "The Best intern ever had. He quickly understood the basic development policy and worked nicely with the other intern and me. He soon got used to our development environment and upgraded the OCR engine to the sufficient accuracy level by researching Tesseract 4 and pre-processing programs. Although it was challenging as a master or Ph.D. student tackles, he patiently and thoroughly worked on the task and found the solution with his resilience, which would be one of the essential qualifications of an engineer. I believe he is an OCR expert now. Also, Itaru coded a post-processing program to parse the text data to a JSON format flexibly adopting open-source codes from GitHub. Moreover, he proposed an improvement of the system during and after the employment period, which made me realize things that I cannot notice by myself. As a result of his great assistance, the development of the OCR engine largely advanced. I highly recommend you consider Itaru a strong candidate as a Python software engineer.",
        "user": "Aki Abekawa - Founder and CEO of Genial Technology, Inc."
      },
      {
        "text": "Itaru has been an inspiring, motivated, and enthusiastic engineer. He has programmed and built a foundation of a core system of a product. Moreover, he was respected by other interns for his excellent leadership in guiding them through work tasks. He also gained credence for teaching technical skills and taking care of those interns to make sure no one was left behind.",
        "user": "Yasunori Sato - Financial Data Scientist of Genial Technology, Inc."
      }
    ]
  }
}
